app/controllers/properties_controller.rb

INSERT INTO "properties" ("created_at", "description", "image", "price", "sold", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save